{
  "topic": "中国文学",
  "content": [
    {
      "id": "literature-intro",
      "title": "中国文学概述",
      "content": "中国文学是世界文学的重要组成部分，拥有五千多年的发展历史。其独特的艺术风格和丰富多样的表现形式对世界文学产生了深远影响。中国文学大致可分为先秦文学、汉魏六朝文学、唐宋文学、元明清文学和现当代文学几个主要发展阶段，每个时期都有其代表性的文学体裁、作品和作家。"
    },
    {
      "id": "pre-qin-literature",
      "title": "先秦文学",
      "content": "先秦文学（约前21世纪-前221年）是中国最早的文学形态，以《诗经》、《楚辞》为代表。《诗经》收录了西周至春秋时期的诗歌305篇，分为风、雅、颂三部分，是中国最早的诗歌总集。《楚辞》以屈原作品为主，代表作有《离骚》、《天问》等，开创了浪漫主义诗歌传统。此外，先秦散文有《尚书》、《左传》、《国语》等历史著作，以及诸子百家的哲理散文，如《论语》、《孟子》、《庄子》、《韩非子》等。"
    },
    {
      "id": "han-wei-literature",
      "title": "汉魏六朝文学",
      "content": "汉魏六朝文学（前206年-589年）以汉赋、建安文学、魏晋玄学、南朝山水诗和文学理论为特色。汉代赋体繁荣，代表作有司马相如的《子虚赋》、《长门赋》等。建安文学以曹操、曹丕、曹植'三曹'和'建安七子'为代表，其诗歌充满慷慨悲凉之情。魏晋时期，陶渊明的田园诗和阮籍、嵇康的'竹林七贤'作品闻名于世。南朝谢灵运、谢朓等人开创山水诗风格，刘勰的《文心雕龙》和钟嵘的《诗品》是重要的文学理论著作。"
    },
    {
      "id": "tang-poetry",
      "title": "唐诗",
      "content": "唐代（618年-907年）是中国古典诗歌的黄金时代，诗歌数量多、题材广、艺术成就高。初唐的'初唐四杰'（王勃、杨炯、卢照邻、骆宾王）奠定了近体诗的基础。盛唐时期，李白的浪漫主义诗风与杜甫的现实主义诗风并称'诗中两峰'。李白代表作有《将进酒》、《静夜思》等，被誉为'诗仙'；杜甫代表作有《三吏》、《三别》等，被称为'诗圣'。中唐的白居易提倡新乐府运动，讽刺诗《长恨歌》、《琵琶行》脍炙人口。晚唐的李商隐、杜牧以绝句见长，风格婉约精致。"
    },
    {
      "id": "song-ci",
      "title": "宋词",
      "content": "宋代（960年-1279年）词这一文学体裁达到了巅峰，形成了豪放派与婉约派两大流派。北宋柳永开创了长调词，苏轼的豪放词气势恢宏，如《念奴娇·赤壁怀古》。秦观、周邦彦等人的婉约词情感细腻，如《鹊桥仙》。南宋辛弃疾的词作融合了豪放与婉约两种风格，代表作《永遇乐·京口北固亭怀古》等表达了强烈的爱国情感。李清照是中国历史上杰出的女词人，其早期作品如《如梦令》清丽婉约，晚期作品如《声声慢》哀婉凄切。"
    },
    {
      "id": "yuan-qu",
      "title": "元曲",
      "content": "元代（1271年-1368年）戏曲和散曲高度发展。戏曲方面，关汉卿的《窦娥冤》、《救风尘》等杂剧揭露了社会黑暗；马致远的《汉宫秋》、《岳阳楼》等作品艺术性极高；王实甫的《西厢记》描写了青年男女追求爱情自由的故事。散曲方面，马致远的《天净沙·秋思》被誉为'小令压卷之作'；张养浩的《山坡羊·潼关怀古》表达了对国家命运的忧虑。元曲的语言通俗生动，贴近百姓生活，在中国文学史上具有重要地位。"
    },
    {
      "id": "ming-qing-novel",
      "title": "明清小说",
      "content": "明清时期（1368年-1911年）是中国古典小说的繁荣时期，涌现出大量优秀作品。四大名著是这一时期的代表：《三国演义》（罗贯中）以描写战争和政治斗争见长；《水浒传》（施耐庵）塑造了108位梁山好汉的形象；《西游记》（吴承恩）构建了奇幻瑰丽的神魔世界；《红楼梦》（曹雪芹）则是一部旨在'反映人情世故'的百科全书式巨著，艺术成就最高。此外，《金瓶梅》开创了世情小说先河；《聊斋志异》是优秀的文言短篇小说集；《儒林外史》则是一部讽刺知识分子的杰作。"
    },
    {
      "id": "modern-literature",
      "title": "现代文学",
      "content": "中国现代文学（1917年-1949年）起源于'五四'新文化运动，以白话文取代文言文，形成了与古代文学截然不同的新文学。鲁迅是现代文学的奠基者，代表作有小说集《呐喊》、《彷徨》和散文集《朝花夕拾》等。郭沫若、郁达夫等人的创造社和闻一多、朱自清等人的新月社形成了20年代的两大文学流派。30年代，巴金的《家》、《春》、《秋》'激流三部曲'，老舍的《骆驼祥子》，曹禺的《雷雨》、《日出》等剧作，以及茅盾、丁玲、沈从文等人的作品，共同构成了现代文学的繁荣景象。"
    },
    {
      "id": "contemporary-literature",
      "title": "当代文学",
      "content": "中国当代文学（1949年至今）经历了17年文学、文革文学和新时期文学几个阶段。17年文学以歌颂社会主义建设为主题，代表作有杨沫的《青春之歌》、柳青的《创业史》等。文革后，以伤痕文学为开端，出现了反思文学、改革文学、寻根文学等多种创作潮流。莫言、余华、贾平凹、王安忆、铁凝等作家在小说领域取得了重大成就，其中莫言于2012年获得诺贝尔文学奖。北岛、舒婷、顾城等人的朦胧诗掀起了当代诗歌创作热潮。近年来，网络文学的兴起为中国文学提供了新的发展方向。"
    },
    {
      "id": "classical-poetry-forms",
      "title": "古典诗歌形式",
      "content": "中国古典诗歌有多种体裁形式。按照发展顺序，主要包括：诗经体（四言为主）、楚辞体（散行，多用'兮'字）、古体诗（句式、字数不拘）、近体诗（格律严谨，包括绝句和律诗）。近体诗又可细分：绝句是四句诗，五言绝句每句五字，七言绝句每句七字；律诗是八句诗，五言律诗每句五字，七言律诗每句七字。近体诗讲究平仄、对仗和押韵。此外，词和曲是配乐的歌词体裁，词有长短不同的词牌，曲分为小令、套数和散套。"
    },
    {
      "id": "literary-theories",
      "title": "中国古代文学理论",
      "content": "中国古代文学理论源远流长，主要包括：儒家的'诗言志'、'文以载道'理论，强调文学的社会功用；曹丕的《典论·论文》提出'文以气为主'，强调作家个性；陆机的《文赋》系统阐述了文学创作过程；刘勰的《文心雕龙》是中国第一部系统的文学理论著作，提出'原道''征圣''宗经'等观点；钟嵘的《诗品》开创诗歌批评先河；司空图的《二十四诗品》从美学角度描述诗歌风格；严羽的《沧浪诗话》提出'兴趣'说；王国维的《人间词话》融合中西方美学思想，提出'境界'说。这些理论共同构成了中国特色的文学批评体系。"
    },
    {
      "id": "literature-genres",
      "title": "中国文学体裁",
      "content": "中国文学体裁丰富多样。诗歌类有诗、词、曲、赋等；散文类有古文、骈文、小品文、游记等；戏曲类有杂剧、传奇、地方戏等；小说类有志怪、传奇、话本、章回体等。每种体裁都有其独特的艺术特点和表现手法。如诗讲究言简意赅、含蓄意境；词长于抒发情感、音律和谐；散文重形散而神不散；戏曲集诗歌、音乐、舞蹈、表演于一体；小说则以叙事见长，塑造人物形象。不同时期，不同体裁的发展程度各异，共同构成了中国文学的丰富画卷。"
    },
    {
      "id": "minority-literature",
      "title": "少数民族文学",
      "content": "中国少数民族文学是中国文学的重要组成部分，主要包括蒙古族、藏族、维吾尔族、哈萨克族、朝鲜族等民族的文学。藏族的《格萨尔王传》是世界最长史诗；蒙古族的《江格尔》也是著名史诗；回族的《花儿》融诗歌与音乐为一体；维吾尔族的《木卡姆》集音乐、舞蹈和诗歌于一体。少数民族文学具有鲜明的民族特色和地域色彩，题材多与自然、爱情、英雄传奇等相关，形式上多为口头文学，后来逐渐形成文字记载。当代少数民族作家如阿来（藏族）、迟子建（满族）等人的作品已成为中国当代文学的重要部分。"
    },
    {
      "id": "foreign-influence",
      "title": "外国文学对中国的影响",
      "content": "外国文学对中国文学的影响主要始于19世纪末20世纪初。梁启超、严复等人翻译和介绍了大量西方文学和思想著作。五四运动后，鲁迅、郭沫若、巴金、茅盾等作家受到俄国现实主义、日本自然主义、法国浪漫主义等流派的影响，创作了具有中国特色的新文学作品。20世纪中期，马克思主义文艺理论成为主导。改革开放后，西方现代主义和后现代主义文学思潮涌入中国，莫言、余华、格非等作家在创作中吸收外来养分，形成了独特的艺术风格。文学翻译事业的发展使中国读者能够接触到更多优秀的外国文学作品，促进了中外文学的交流与融合。"
    }
  ]
} 