{
  "topic": "植物细胞结构",
  "content": [
    {
      "id": "cell-intro",
      "title": "植物细胞概述",
      "content": "植物细胞是构成植物体的基本单位，是具有生命的结构和功能的基本单元。植物细胞与动物细胞相比，具有特殊的结构，如细胞壁、中央液泡和叶绿体等。这些特殊结构使植物细胞能够进行光合作用，维持细胞形态，并支撑植物体。"
    },
    {
      "id": "cell-wall",
      "title": "细胞壁",
      "content": "细胞壁是植物细胞特有的结构，位于细胞膜外侧，主要由纤维素、半纤维素和果胶等多糖类物质构成。细胞壁具有支持和保护细胞的功能，同时允许水、矿物质和小分子物质通过。初生壁较薄，次生壁较厚，木质化的细胞壁含有木质素，增强了细胞的机械强度。"
    },
    {
      "id": "cell-membrane",
      "title": "细胞膜",
      "content": "细胞膜又称质膜，是由磷脂双分子层和蛋白质构成的选择性半透膜，控制物质进出细胞。植物细胞的细胞膜位于细胞壁内侧，具有流动性，能够进行胞吞和胞吐等活动。细胞膜上有多种蛋白质，包括载体蛋白、通道蛋白、受体蛋白等，参与物质转运和信号传导。"
    },
    {
      "id": "cytoplasm",
      "title": "细胞质",
      "content": "细胞质是细胞膜和细胞核之间的区域，包括细胞质基质和各种细胞器。细胞质基质是一种半流动性胶体，含有水、蛋白质、脂类、糖类、无机盐等，是细胞内各种生化反应的场所。细胞器悬浮在细胞质基质中，各司其职，协同工作。"
    },
    {
      "id": "nucleus",
      "title": "细胞核",
      "content": "细胞核是植物细胞中最大的细胞器，通常位于细胞中央或靠近一侧。它由核膜、核基质、染色质和核仁组成。核膜是双层膜结构，有核孔复合体。细胞核控制细胞的生命活动，存储遗传信息（DNA），参与蛋白质合成的调控。细胞核在细胞分裂前会复制DNA，形成染色体。"
    },
    {
      "id": "chloroplast",
      "title": "叶绿体",
      "content": "叶绿体是植物细胞特有的细胞器，呈椭圆形或近圆形，直径2-4μm，长5-10μm。叶绿体由双层膜包围，内部含有类囊体系统和基质。叶绿体内含有叶绿素a和叶绿素b，能够吸收光能，是光合作用的主要场所，将光能转化为化学能，合成有机物。叶绿体具有自己的DNA和核糖体，可以半自主复制。"
    },
    {
      "id": "mitochondria",
      "title": "线粒体",
      "content": "线粒体是细胞的'动力工厂'，呈椭圆形、球形或杆状，大小通常为0.5-1.0μm。线粒体由外膜和内膜组成，内膜向内折叠形成嵴，增大表面积。线粒体内部称为基质，含有多种酶类。线粒体是细胞呼吸的主要场所，通过氧化分解有机物（如葡萄糖）释放能量，并将能量以ATP形式储存。线粒体也具有自己的DNA和核糖体。"
    },
    {
      "id": "vacuole",
      "title": "中央液泡",
      "content": "中央液泡是成熟植物细胞中最大的细胞器，占据细胞体积的80%以上。液泡被单层膜（液泡膜或张力膜）包围，内部充满液泡液（细胞液）。液泡具有多种功能：储存养料和废物；维持细胞的形态和膨压；调节细胞内离子平衡；参与细胞的自我消化和防御反应；储存色素，如花青素等。"
    },
    {
      "id": "golgi-apparatus",
      "title": "高尔基体",
      "content": "高尔基体由扁平囊状结构（高尔基囊）堆叠而成，一端为形成面，与内质网相连；另一端为成熟面，产生分泌泡。高尔基体主要功能包括：修饰、分类和包装蛋白质；合成多糖和糖脂；形成溶酶体；参与细胞壁和细胞膜的形成；分泌物质等。"
    },
    {
      "id": "endoplasmic-reticulum",
      "title": "内质网",
      "content": "内质网是由膜构成的网状管道和扁平囊，分为粗面内质网（附着核糖体）和滑面内质网（无核糖体）。粗面内质网是蛋白质合成和初步加工的场所；滑面内质网是脂类合成和解毒作用的场所。内质网与细胞膜、核膜相连，形成细胞内的通道系统。"
    },
    {
      "id": "ribosome",
      "title": "核糖体",
      "content": "核糖体是蛋白质合成的场所，由rRNA和蛋白质构成，无膜包被。核糖体可以附着在粗面内质网上（固定核糖体），也可以分散在细胞质基质中（游离核糖体）。核糖体由大小两个亚基组成，在蛋白质合成时结合成完整的核糖体。"
    },
    {
      "id": "peroxisome",
      "title": "过氧化物酶体",
      "content": "过氧化物酶体是由单层膜包围的小型细胞器，含有氧化酶和过氧化氢酶等多种酶类。过氧化物酶体参与细胞代谢中的氧化反应，如脂肪酸β氧化、光呼吸中的糖酵解等。过氧化物酶体产生的过氧化氢（H₂O₂）有毒，但随即被过氧化氢酶分解为水和氧气。"
    },
    {
      "id": "cytoskeleton",
      "title": "细胞骨架",
      "content": "细胞骨架是由蛋白质纤维构成的网络结构，包括微丝、微管和中间纤维。细胞骨架维持细胞形态，参与细胞内物质运输、细胞分裂和细胞运动等过程。在植物细胞中，微管参与细胞壁纤维素的沉积方向，影响细胞的生长方向。"
    }
  ]
} 