{
  "topic": "有机化学基础",
  "content": [
    {
      "id": "organic-intro",
      "title": "有机化学概述",
      "content": "有机化学是研究含碳化合物的结构、性质、组成、反应和制备的化学分支，是化学中最大的学科之一。最初，有机化合物被认为只能来源于生物体，直到1828年维勒成功合成尿素，打破了有机和无机化合物的界限。有机化合物数量众多，结构复杂多样，应用广泛，涉及医药、农药、染料、高分子材料、食品、能源等领域。有机化学的基本原理包括分子结构、化学键理论、反应机理等，为理解生物化学和材料科学提供了基础。"
    },
    {
      "id": "carbon-bonding",
      "title": "碳的成键特性",
      "content": "碳元素（C）具有独特的成键特性，使其能形成数量庞大的有机化合物。碳原子有4个价电子，可以形成4个共价键。碳可以与其他碳原子形成单键、双键或三键，也可与氢、氧、氮、硫等原子形成化学键，构成各种官能团。碳原子可以排列成直链、支链或环状结构，甚至形成三维立体结构。这种多样的键合方式产生了数以百万计的有机化合物。碳-碳键的稳定性使得有机化合物具有一定的稳定性，但又能发生各种化学反应。"
    },
    {
      "id": "isomerism",
      "title": "同分异构现象",
      "content": "同分异构是指具有相同分子式但结构不同的化合物。主要类型包括：构造异构（原子连接顺序不同，如丁烷和2-甲基丙烷）；位置异构（官能团位置不同，如1-丙醇和2-丙醇）；官能团异构（含有不同官能团，如乙醇和二甲醚）；立体异构（原子空间排布不同）。立体异构又分为：几何异构（顺-反异构，如顺-2-丁烯和反-2-丁烯）和光学异构（镜像异构，如左旋和右旋乳酸）。手性是一种特殊的立体异构，指分子与其镜像不能重合，类似于左右手。手性化合物具有光学活性，能旋转平面偏振光。"
    },
    {
      "id": "hydrocarbons",
      "title": "烃类化合物",
      "content": "烃是只含碳和氢的有机化合物，是有机化学的基础。按碳链结构可分为：脂肪烃（链状烃）和芳香烃（含苯环结构）。脂肪烃又分为烷烃（只含单键，如甲烷CH₄）、烯烃（含碳-碳双键，如乙烯C₂H₄）和炔烃（含碳-碳三键，如乙炔C₂H₂）。环烷烃是碳原子首尾相连形成环状结构的饱和烃。芳香烃以苯（C₆H₆）为代表，具有特殊的稳定性和反应性。烃类是石油和天然气的主要成分，是重要的能源和化工原料。烃的性质随碳链长度和不饱和度增加而变化，如熔点、沸点升高，溶解性降低。"
    },
    {
      "id": "functional-groups",
      "title": "官能团",
      "content": "官能团是决定有机化合物化学性质的原子团。主要官能团包括：羟基(-OH，醇、酚)；羰基(C=O，醛、酮)；羧基(-COOH，羧酸)；酯基(-COOR)；酰胺基(-CONH₂)；胺基(-NH₂,-NHR,-NR₂)；卤素(-F,-Cl,-Br,-I)；硫醇基(-SH)；硝基(-NO₂)；氰基(-CN)等。官能团决定了化合物的极性、酸碱性、氧化还原性、反应活性等化学性质，以及溶解性、沸点等物理性质。官能团转化是有机合成的基础，可通过氧化、还原、加成、消除等反应实现不同官能团间的相互转换。"
    },
    {
      "id": "alkanes",
      "title": "烷烃",
      "content": "烷烃是只含碳-碳单键和碳-氢键的饱和烃，通式为CₙH₂ₙ₊₂。直链烷烃按碳原子数命名：甲烷(CH₄)、乙烷(C₂H₆)、丙烷(C₃H₈)、丁烷(C₄H₁₀)等。支链烷烃根据IUPAC命名法进行命名，确定主链和取代基。烷烃的物理性质：随碳链增长，沸点升高；C₁-C₄为气体，C₅-C₁₇为液体，C₁₈以上为固体；不溶于水，溶于非极性溶剂。烷烃的化学性质相对惰性，主要反应有：自由基取代（如氯化反应）、裂解反应（热裂解或催化裂解）、燃烧反应。烷烃是石油的主要成分，用作燃料和有机合成原料。"
    },
    {
      "id": "alkenes-alkynes",
      "title": "烯烃和炔烃",
      "content": "烯烃含有碳-碳双键，通式为CₙH₂ₙ，典型代表是乙烯(C₂H₄)。炔烃含有碳-碳三键，通式为CₙH₂ₙ₋₂，典型代表是乙炔(C₂H₂)。烯烃的命名以-烯为后缀，炔烃以-炔为后缀。不饱和烃的化学性质活泼，主要发生加成反应：加氢（氢化）、加卤素、加卤化氢、加水（水合）等。加成反应通常遵循马氏规则：氢加到碳原子多的一端。聚合反应是烯烃的重要反应，如乙烯聚合成聚乙烯。烯烃和炔烃可以通过氧化反应断裂碳-碳双键或三键。烯烃和炔烃广泛用于化工合成，如制造塑料、橡胶、溶剂、药物等。"
    },
    {
      "id": "aromatic",
      "title": "芳香族化合物",
      "content": "芳香族化合物含有苯环结构，具有特殊的稳定性。苯(C₆H₆)是最简单的芳香烃，由6个碳原子形成平面正六边形环，碳原子间的键长介于单键和双键之间。苯的稳定性来自于π电子的离域，符合休克尔规则(4n+2个π电子)。芳香族化合物主要发生亲电取代反应，如硝化、卤化、磺化、烷基化等。取代基影响苯环的反应活性：给电子基团(如-OH,-NH₂,-CH₃)活化苯环，定位为邻、对位；吸电子基团(如-NO₂,-COOH,-CN)钝化苯环，定位为间位。多环芳烃如萘、蒽、菲等具有更复杂的芳香性。许多芳香族化合物用于制药、染料、农药等领域。"
    },
    {
      "id": "alcohols-phenols",
      "title": "醇和酚",
      "content": "醇含有羟基(-OH)连接在脂肪碳上，通式为R-OH。根据羟基连接的碳原子类型分为伯醇、仲醇和叔醇。命名以-醇为后缀，如甲醇、乙醇、1-丙醇、2-丙醇等。醇的物理性质：小分子醇可与水形成氢键，溶于水；随碳链增长，水溶性降低，沸点升高。醇的化学性质：弱酸性(pKa约16-18)；与活泼金属反应生成醇盐；脱水反应生成烯烃；氧化反应(伯醇氧化为醛再到羧酸，仲醇氧化为酮)；与羧酸反应形成酯。酚是羟基连接在芳香环上的化合物，如苯酚。酚的酸性(pKa约10)比醇强但比羧酸弱；酚羟基活化苯环，易发生亲电取代反应；酚类物质常用作消毒剂和合成材料。"
    },
    {
      "id": "aldehydes-ketones",
      "title": "醛和酮",
      "content": "醛和酮含有羰基(C=O)，醛的羰基连接至少一个氢原子(R-CHO)，酮的羰基连接两个碳原子(R-CO-R')。醛的命名以-醛为后缀，如甲醛、乙醛；酮以-酮为后缀，如丙酮、丁酮。物理性质：羰基的极性使小分子醛酮水溶性好；随碳链增长，水溶性降低，沸点升高。化学性质：醛酮主要发生亲核加成反应，如与氢氰酸、格氏试剂、醇等的加成；还可发生缩合反应，如醛醇缩合。醛比酮活性高，易被氧化：醛可被银氨溶液(托伦斯试剂)或斐林试剂氧化，而酮不能。醛酮在有机合成中用途广泛，如制造树脂、溶剂、香料等。"
    },
    {
      "id": "carboxylic-acids",
      "title": "羧酸",
      "content": "羧酸含有羧基(-COOH)，通式为R-COOH。命名以-酸为后缀，如甲酸、乙酸、丙酸等。物理性质：羧基能形成氢键，小分子羧酸溶于水；随碳链增长，水溶性减弱，沸点升高；低级羧酸气味刺激。化学性质：羧酸呈弱酸性(pKa约4-5)，比醇和酚强；与碱反应生成盐；与醇反应生成酯(酯化反应)；可被LiAlH₄还原为醇；羧基活化α位氢，可发生α-取代反应。羧酸衍生物包括酯、酰卤、酸酐、酰胺等，它们可相互转化。羧酸广泛应用于食品添加剂、药物、香料、聚合物等领域。"
    },
    {
      "id": "amines",
      "title": "胺类",
      "content": "胺是氨(NH₃)的有机衍生物，氨分子中的氢被烃基取代形成。根据取代的氢原子数分为伯胺(RNH₂)、仲胺(R₂NH)和叔胺(R₃N)。命名常采用通用名称，加前缀\"N-\"表示氮上的取代基。物理性质：小分子胺有类似氨的气味；可形成氢键，低分子量胺溶于水；沸点高于相应烃，但低于醇。化学性质：胺是有机碱(pKb约3-4)，可与酸形成铵盐；与酰卤或酸酐反应生成酰胺；芳香胺可发生重氮化反应，生成重氮盐，进一步反应生成多种芳香化合物。胺在生物体内广泛存在，如氨基酸、生物碱、神经传递物质等；工业上用于制药、染料、聚合物等。"
    },
    {
      "id": "reaction-mechanisms",
      "title": "有机反应机理",
      "content": "有机反应机理描述化学反应过程中键的断裂和形成。主要类型：亲核取代(SN1和SN2)和亲核加成反应，亲电取代(如芳香环上)和亲电加成反应(如烯烃上)，自由基反应，配体交换反应，氧化还原反应等。反应历程通常包括：起始物、中间体(如碳正离子、碳负离子、自由基等)和产物。影响反应的因素有：立体效应(空间位阻)、电子效应(诱导效应和共轭效应)、溶剂效应、催化剂等。反应速率取决于活化能和分子碰撞频率。立体化学关注反应中立体构型的变化，如保持构型、翻转构型或消旋。了解反应机理有助于预测产物、优化反应条件和设计新合成路线。"
    },
    {
      "id": "synthesis",
      "title": "有机合成",
      "content": "有机合成是构建复杂有机分子的过程，通常需要多步反应。合成策略包括：逆合成分析(从目标分子逆向思考)，官能团转化，骨架构建(形成碳-碳键)，保护基策略(暂时保护敏感官能团)，立体选择性控制等。常用的碳-碳键形成反应有：格氏反应、威提希反应、Diels-Alder反应、醛醇缩合、迈克尔加成等。绿色化学原则强调：减少废物、原子经济性高、使用安全溶剂和试剂、设计高能效过程等。现代合成技术包括：微波辅助合成、流动化学、固相合成、生物催化等。有机合成在医药、农药、材料、染料等领域有广泛应用，如药物分子、天然产物和功能材料的合成。"
    }
  ]
} 